package by.it.group973601.selezniova.lesson04;

import java.io.FileInputStream;
import java.io.FileNotFoundException;
import java.io.InputStream;
import java.util.Arrays;
import java.util.Scanner;

/*
Реализуйте сортировку слиянием для одномерного массива.
Сложность алгоритма должна быть не хуже, чем O(n log n)

Первая строка содержит число 1<=n<=10000,
вторая - массив A[1…n], содержащий натуральные числа, не превосходящие 10E9.
Необходимо отсортировать полученный массив.

Sample Input:
5
2 3 9 2 9
Sample Output:
2 2 3 9 9
*/
public class B_MergeSort {

    int[] merge(int[] a, int[] b) {
        //позиции текущего элемента
        int aIndex = 0;
        int bIndex = 0;
        int[] merged = new int[a.length + b.length];
        for (int k = 0; k < merged.length; k++) {
            //проверяю что не последний и проверяю что элемент одного массива меньше элемента второго массива
            if (bIndex == b.length || (aIndex < a.length && a[aIndex] < b[bIndex])) {
                merged[k] = a[aIndex];
                aIndex++;
            } else {
                merged[k] = b[bIndex];
                bIndex++;
            }
        }
        return merged;
    }

    int[] mergeSort(int[] a) {
        if (a.length == 1) {
            return a;
        }
        int leftSize = a.length / 2;
        int[] left = Arrays.copyOfRange(a, 0, leftSize);
        int[] right = Arrays.copyOfRange(a, leftSize, a.length);
        return merge(mergeSort(left), mergeSort(right));
    }

    int[] getMergeSort(InputStream stream) throws FileNotFoundException {
        //подготовка к чтению данных
        Scanner scanner = new Scanner(stream);
        //!!!!!!!!!!!!!!!!!!!!!!!!!     НАЧАЛО ЗАДАЧИ     !!!!!!!!!!!!!!!!!!!!!!!!!

        //размер массива
        int n = scanner.nextInt();
        //сам массив
        int[] a=new int[n];
        for (int i = 0; i < n; i++) {
            a[i] = scanner.nextInt();
            System.out.println(a[i]);
        }

        // тут ваше решение (реализуйте сортировку слиянием)
        // https://ru.wikipedia.org/wiki/Сортировка_слиянием



        a = mergeSort(a);


        //!!!!!!!!!!!!!!!!!!!!!!!!!     КОНЕЦ ЗАДАЧИ     !!!!!!!!!!!!!!!!!!!!!!!!!
        return a;
    }
    public static void main(String[] args) throws FileNotFoundException {
        String root = System.getProperty("user.dir") + "/src/";
        InputStream stream = new FileInputStream(root + "by/it/a_khmelev/lesson04/dataB.txt");
        B_MergeSort instance = new B_MergeSort();
        //long startTime = System.currentTimeMillis();
        int[] result=instance.getMergeSort(stream);
        //long finishTime = System.currentTimeMillis();
        for (int index:result){
            System.out.print(index+" ");
        }
    }


}
